results/pro6000_x_1_cpatonn_GLM-4.5-Air-AWQ-4bit_vllm_benchmark.txt
============ Serving Benchmark Result ============
Successful requests:                     1200      
Maximum request concurrency:             400       
Benchmark duration (s):                  1194.24   
Total input tokens:                      1198147   
Total generated tokens:                  1200000   
Request throughput (req/s):              1.00      
Output token throughput (tok/s):         1004.82   
Peak output token throughput (tok/s):    2100.00   
Peak concurrent requests:                410.00    
Total Token throughput (tok/s):          2008.10   
---------------Time to First Token----------------
Mean TTFT (ms):                          237422.60 
Median TTFT (ms):                        274254.58 
P99 TTFT (ms):                           362530.17 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          104.93    
Median TPOT (ms):                        86.84     
P99 TPOT (ms):                           162.94    
---------------Inter-token Latency----------------
Mean ITL (ms):                           105.02    
Median ITL (ms):                         69.92     
P99 ITL (ms):                            940.94    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          342250.34 
Median E2EL (ms):                        366503.48 
P99 E2EL (ms):                           447470.17 
==================================================

============ Docker Compose Configuration ============
services:
  vllm_0:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_container_0
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              device_ids: ['0']
              capabilities: [gpu]
    volumes:
      - /hf_models:/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
      - CUDA_VISIBLE_DEVICES=0
    ports:
      - "8000:8000"
    shm_size: '16gb'
    ipc: host
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.9
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 1
      --model /hf_models/cpatonn/GLM-4.5-Air-AWQ-4bit
      --served-model-name cpatonn/GLM-4.5-Air-AWQ-4bit
      --dtype float16 --tool-call-parser glm45 --reasoning-parser glm45 --max-model-len 8192 --enable-expert-parallel
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health && curl -f http://localhost:8000/v1/models | grep -q 'object.*list'"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 600s

  benchmark:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_client
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              count: all
              capabilities: [gpu]
    volumes:
      - /hf_models:/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
      - CUDA_VISIBLE_DEVICES=""
    entrypoint: ["/bin/bash", "-c"]
    command: ["sleep infinity"]
    profiles:
      - tools

============ Benchmark Command ============
vllm bench serve     --model cpatonn/GLM-4.5-Air-AWQ-4bit     --dataset-name random     --random-input-len 1000     --random-output-len 1000     --max-concurrency 400     --num-prompts 1200     --ignore-eos     --backend openai-chat     --endpoint /v1/chat/completions     --percentile-metrics ttft,tpot,itl,e2el     --base-url http://vllm_0:8000
==================================================