results/rtx4090_x_2_QuantTrio_Qwen3-Coder-30B-A3B-Instruct-AWQ_vllm_benchmark.txt
============ Serving Benchmark Result ============
Successful requests:                     1000      
Maximum request concurrency:             200       
Benchmark duration (s):                  473.17    
Total input tokens:                      997272    
Total generated tokens:                  1000000   
Request throughput (req/s):              2.11      
Output token throughput (tok/s):         2113.41   
Peak output token throughput (tok/s):    3658.00   
Peak concurrent requests:                226.00    
Total Token throughput (tok/s):          4221.05   
---------------Time to First Token----------------
Mean TTFT (ms):                          57054.29  
Median TTFT (ms):                        57944.67  
P99 TTFT (ms):                           75300.65  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          29.52     
Median TPOT (ms):                        24.32     
P99 TPOT (ms):                           46.61     
---------------Inter-token Latency----------------
Mean ITL (ms):                           29.59     
Median ITL (ms):                         22.03     
P99 ITL (ms):                            127.07    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          86543.91  
Median E2EL (ms):                        94704.74  
P99 E2EL (ms):                           99418.35  
==================================================